#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_app.coreapi-app will be created
  + resource "digitalocean_app" "coreapi-app" {
      + active_deployment_id = (known after apply)
      + created_at           = (known after apply)
      + default_ingress      = (known after apply)
      + id                   = (known after apply)
      + live_url             = (known after apply)
      + updated_at           = (known after apply)
      + urn                  = (known after apply)

      + spec {
          + domains = (known after apply)
          + name    = "coreapi-app"
          + region  = "nyc1"

          + domain {
              + name     = (known after apply)
              + type     = (known after apply)
              + wildcard = (known after apply)
              + zone     = (known after apply)
            }

          + service {
              + http_port      = 8080
              + instance_count = 1
              + name           = "coreapi-app-service"
              + run_command    = (known after apply)

              + image {
                  + registry      = "travistrle"
                  + registry_type = "DOCKER_HUB"
                  + repository    = "core-api"
                  + tag           = "latest"

                  + deploy_on_push {
                      + enabled = (known after apply)
                    }
                }

              + routes {
                  + path                 = (known after apply)
                  + preserve_path_prefix = (known after apply)
                }
            }
        }
    }

  # digitalocean_database_cluster.postgres-onegrid will be created
  + resource "digitalocean_database_cluster" "postgres-onegrid" {
      + database             = (known after apply)
      + engine               = "pg"
      + host                 = (known after apply)
      + id                   = (known after apply)
      + name                 = "onegrid-postgres-cluster"
      + node_count           = 1
      + password             = (sensitive value)
      + port                 = (known after apply)
      + private_host         = (known after apply)
      + private_network_uuid = (known after apply)
      + private_uri          = (sensitive value)
      + region               = "nyc1"
      + size                 = "db-s-1vcpu-1gb"
      + uri                  = (sensitive value)
      + urn                  = (known after apply)
      + user                 = (known after apply)
      + version              = "15"
    }

  # digitalocean_database_db.onegrid-coreapi-database will be created
  + resource "digitalocean_database_db" "onegrid-coreapi-database" {
      + cluster_id = (known after apply)
      + id         = (known after apply)
      + name       = "coreapi"
    }

  # digitalocean_database_user.onegridapiuser will be created
  + resource "digitalocean_database_user" "onegridapiuser" {
      + cluster_id = (known after apply)
      + id         = (known after apply)
      + name       = "onegridapipostgresuser"
      + password   = (sensitive value)
      + role       = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @travistrle, Action: `pull_request`*